trunk/Server_Yii/Scripts/Scalability/Tsung/Test3/jabber_presence_over_5_mins.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/share/tsung/tsung-1.0.dtd">
<tsung loglevel="info" version="1.0">

	<clients>
		<client host="localhost" use_controller_vm="true" maxusers="50000"></client>
	</clients>

	<servers>
		<server host="neatocloud1j.rajatogo.com" port="5222" type="tcp"></server>
	</servers>

	<load>
		<arrivalphase phase="1" duration="10" unit="minute">
			<users arrivalrate="100" unit="second"></users>
		</arrivalphase>
	</load>

	<options>
		<option type="ts_jabber" name="global_number" value="100"></option>
		<option type="ts_jabber" name="userid_max" value="10000"></option>
		<option type="ts_jabber" name="domain" value="neatocloud1j.rajatogo.com"></option>
		<option type="ts_jabber" name="username" value="testing"></option>
		<option type="ts_jabber" name="passwd" value="password"></option>
	</options>

	<sessions>
		<session probability="80" name="robot_online" type="ts_jabber">

			<request> <jabber type="connect" ack="local"></jabber> </request>

			<thinktime value="1"></thinktime>

			<transaction name="authenticate">
				<request>
					<jabber type="auth_sasl" ack="local"></jabber>
				</request>

				<request>
					<jabber type="connect" ack="local"></jabber>
				</request>

				<request>
					<jabber type="auth_sasl_bind" ack="local"></jabber>
				</request>
				<request>
					<jabber type="auth_sasl_session" ack="local"></jabber>
				</request>
			</transaction>

			<request>
				<jabber type="presence:initial" ack="no_ack" />
			</request>

			<thinktime value="1"></thinktime>

			<transaction name="online">
				<request>
					<jabber type="chat" ack="no_ack" size="16" destination="online"></jabber>
				</request>
			</transaction>

			<for from="1" to="2" var="index" incr="1">
				<thinktime value="300"></thinktime>
				<request subst='true'>
					<jabber type="presence:broadcast" ack="no_ack" />					
				</request>
			</for>

  			<transaction name="offline">
				<request>
					<jabber type="chat" ack="no_ack" size="56" destination="offline"></jabber>
				</request>
			</transaction>
			<thinktime value="1"></thinktime>
			<transaction name="close">
				<request>
					<jabber type="close" ack="no_ack"></jabber>
				</request>
			</transaction>

		</session>

		<session name="robot_ping" probability="20" type="ts_http">
			<thinktime value="120"></thinktime>
			<for from="1" to="8" var="index" incr="1">
 				<setdynvars sourcetype="random_number" start="1" end="10000">
        			<var name="serial_number" />
    			</setdynvars>
				<request subst="true">
					<http
						url="http://neatocloud1.rajatogo.com/api/rest/json/?method=robot.ping_from_robot"
						method="POST" version="1.1"
						contents="api_key=1e26686d806d82144a71ea9a99d1b3169adaad917&amp;serial_number=testing%%_serial_number%%"></http>
				</request>
				<thinktime value="60"></thinktime>
			</for>
		</session>

	</sessions>

</tsung>